OldReleases/OF7and8/OFtutorial14_SIMPLE_algorithm/testCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet
	{
		type            fixedValue;
		value           uniform (1 0 0);
	}

    walls
    {
        type            noSlip;
    }

	outlet
	{
		type 			zeroGradient;
	}

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
